---
kind: type
id: T:Autodesk.Revit.DB.Electrical.AreaBasedLoadData
source: html/10433e6e-e655-db35-54a9-cc8034cff631.htm
---
# Autodesk.Revit.DB.Electrical.AreaBasedLoadData

Represents the electrical area based load data.

## Syntax (C#)
```csharp
public class AreaBasedLoadData : ZoneElementDomainData
```